//---------------------------------------------------------------------------
// < TestSTO >
//---------------------------------------------------------------------------
// Программа для визуализации уравнений движений
// классической и релятивистской физики, иллюстрирующая
// противоречие в Специальной Теории Относительности А.Эйнштейна
//---------------------------------------------------------------------------
// Автор: Александр Меркелов (free_mind2@list.ru)
// Форум программы: http://www.free---mind.mirbb.net/t7-topic
//---------------------------------------------------------------------------

#ifndef Unit_frmHelpExp2H
#define Unit_frmHelpExp2H
//---------------------------------------------------------------------------
#include <Classes.hpp>
#include <Controls.hpp>
#include <StdCtrls.hpp>
#include <Forms.hpp>
#include "Unit_frmHelpExp1.h"
#include <ComCtrls.hpp>
//---------------------------------------------------------------------------
class TfrmHelpExp2 : public TfrmHelpExp1
{
__published:	// IDE-managed Components
private:	// User declarations
public:		// User declarations
	__fastcall TfrmHelpExp2(TComponent* Owner);
};
//---------------------------------------------------------------------------
extern PACKAGE TfrmHelpExp2 *frmHelpExp2;
//---------------------------------------------------------------------------
#endif
