//---------------------------------------------------------------------------
// < TestSTO >
//---------------------------------------------------------------------------
// Программа для визуализации уравнений движений
// классической и релятивистской физики, иллюстрирующая
// противоречие в Специальной Теории Относительности А.Эйнштейна
//---------------------------------------------------------------------------
// Автор: Александр Меркелов (free_mind2@list.ru)
// Форум программы: http://www.free---mind.mirbb.net/t7-topic
//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Unit_frmHelpExp2.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma link "Unit_frmHelpExp1"
#pragma resource "*.dfm"
TfrmHelpExp2 *frmHelpExp2;
//---------------------------------------------------------------------------
__fastcall TfrmHelpExp2::TfrmHelpExp2(TComponent* Owner)
	: TfrmHelpExp1(Owner)
{
}
//---------------------------------------------------------------------------
